controllers/SiteController.php


 } //end  if  Save

} //END if(isset($_POST['MyDBStart']
//END  INSERTING---------------------





//Start  Active  Record-----------------------------------------------------------------------------------
//$actrec = \app\models\Mydbstart::findAll([1,2,3]); // WORKING!! just the  same  as below;

// Start if  Person is  LOGGED or UnLoGGED (!Guest/Guest)
       //If Logged Show  only Users log  else {show  any  last  logs}
    if(!Yii::$app->user->isGuest){
  $activeRec = Mydbstart::find()   ->orderBy ('mydb_id DESC')  ->limit('5') ->where(['mydb_user' => Yii::$app->user->identity->username])  ->all();  // WORKING!!  //->where(['mydb_user' => Yii::$app->user->identity->username]);
                                 }else {
  $activeRec = Mydbstart::find()   ->orderBy ('mydb_id DESC')  ->limit('5')  ->all();
//END if  Person is  LOGGED or UnLoGGED (!Guest/Guest)
                                        }



---
SELECT * FROM `mydbstart` WHERE `mydb_user`='Dima'